OpenFOAM-8/chapter4/multiRegionHeaterFine/constant/surrondingSolid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/surrondingSolid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    minX
    {
        type            patch;
        nFaces          2560;
        startFace       187344;
    }
    maxX
    {
        type            patch;
        nFaces          2560;
        startFace       189904;
    }
    minY
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2560;
        startFace       192464;
    }
    minZ
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          816;
        startFace       195024;
    }
    maxZ
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          816;
        startFace       195840;
    }
    surrondingSolid_to_air
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          5120;
        startFace       196656;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     air_to_surrondingSolid;
    }
    surrondingSolid_to_heater
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          2560;
        startFace       201776;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_surrondingSolid;
    }
)

// ************************************************************************* //
